# Конспект 6: statiс

## Статические переменные в C++
Использование ключевого слова **static** с локальными переменными изменяет их свойство продолжительности жизни с автоматического на статическое (или «фиксированное»). **Статическая переменная** (или **«переменная со статической продолжительностью жизни»**) сохраняет свое значение даже после выхода из блока, в котором она определена. То есть она создается (и инициализируется) только один раз, а затем сохраняется на протяжении выполнения всей программы.

## Примеры
### Без использования **static**:
    void my_func() 
    {
      int i = 0;     
      ++i;
      std :: cout << i;       
    }
 
    int main() 
    {
      my_func();
      my_func();
      my_func();
    }

После запуска мы увидим следующий вывод:
1
1
1   
   
### С использованием **static**:
void my_func() 
    {
      static int i = 0;     
      ++i;
      std :: cout << i;       
    }
 
    int main() 
    {
      my_func();
      my_func();
      my_func();
    }
    
 Вывод после запуска программы:
 1
 2
 3
